//
//  1309.swift
//  BJ
//
//  Created by 송재훈 on 1/24/25.
//


let N = Int(readLine()!)!

var dp: [[Int]] = .init(repeating: .init(repeating: 0, count: 100001), count: 3)
(dp[0][1], dp[1][1], dp[2][1]) = (1, 1, 1)

for i in 2...100000 {
    dp[0][i] = (dp[0][i - 1] + dp[1][i - 1] + dp[2][i - 1]) % 9901
    dp[1][i] = (dp[0][i - 1] + dp[2][i - 1]) % 9901
    dp[2][i] = (dp[0][i - 1] + dp[1][i - 1]) % 9901
}

print((dp[0][N] + dp[1][N] + dp[2][N]) % 9901)
// ㅁ
// ㅁ

// ㅇ
// ㅁ

// ㅁ
// ㅇ

// ---

// ㅁ
// ㅁ
// ->
// ㅁㅁ  ㅁㅇ  ㅁㅁ
// ㅁㅁ, ㅁㅁ, ㅁㅇ


// ㅇ
// ㅁ
// ->
// ㅇㅁ  ㅇㅁ
// ㅁㅁ, ㅁㅇ

// ㅁ
// ㅇ
// ->
// ㅁㅁ  ㅁㅇ
// ㅇㅁ, ㅇㅁ
