//
//  2193-2.swift
//  BJ
//
//  Created by 송재훈 on 3/11/25.
//


//3

// MARK: 풀이
// 1. 피보나치의 모양을 띔
// 2. 마지막이 0이면 0, 1을 붙일 수 있음
//    마지막이 1이면 0을 붙일 수 있음
//    -> 2차원 배열에 마지막이 0인 수, 1인 수를 넣고,
//       [i - 1][0] * 2 + [i - 1][1]

//1

//10

//100
//101

//1000
//1010
//1001

//10000
//10100
//10010
//10001
//10101

//100000
//100001
//101001
//101000
//100101
//100100
//100010
//101010

let N = Int(readLine()!)!
var dp = [0, 1] + [Int](repeating: 0, count: N + 1)
for i in 2...(N + 1) { dp[i] = dp[i - 2] + dp[i - 1] }

print(dp[N])
